
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |      16 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                             |
|:--------:|:------------------------------------------------------------------------------------------------------|
|    🟢     | `module.gha.module.gha-admin.aws_iam_policy.github`                                                   |
|    🟢     | `module.gha.module.gha-admin.aws_iam_role.admin`                                                      |
|    🟢     | `module.gha.module.gha-admin.aws_iam_role.github`                                                     |
|    🟢     | `module.gha.module.gha-admin.aws_iam_role_policy_attachment.admin`                                    |
|    🟢     | `module.gha.module.gha-admin.aws_iam_role_policy_attachment.github`                                   |
|    🟢     | `module.gha.module.state-bucket.aws_dynamodb_table.terraform_locks`                                   |
|    🟢     | `module.gha.module.state-bucket.aws_s3_bucket.state-bucket`                                           |
|    🟢     | `module.gha.module.state-bucket.aws_s3_bucket_public_access_block.public_access`                      |
|    🟢     | `module.gha.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default`           |
|    🟢     | `module.gha.module.state-bucket.aws_s3_bucket_versioning.enabled`                                     |
|    🟢     | `module.gha.module.state-bucket.random_pet.suffix`                                                    |
|    🟢     | `module.gha.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢     | `module.gha.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢     | `module.gha.module.gha-admin.module.state-manager.aws_iam_role.state-manager`                         |
|    🟢     | `module.gha.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢     | `module.gha.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
|    🟢     | `data.external.env:`                                                                                  |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/d2693716-91b9-4993-8c8d-a98b695aca37/terraform-bin plan -var-file=configuration.tfvars -no-color --out=tf.plan
data.external.env: Reading...
data.external.env: Read complete after 0s [id=-]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
module.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_team_members.dev: Refreshing state... [id=7332815]
module.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=4085685291]
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
module.gha.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...
data.aws_secretsmanager_secrets.gh_secrets: Reading...
module.gha.module.gha-admin.data.aws_iam_policy.admin: Reading...
module.gha.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
module.gha.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...
module.gha.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=4074999951]
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]
aws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]
data.aws_secretsmanager_secret_version.codacy_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]
module.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]
module.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]
module.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]
module.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]
module.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]
module.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]
module.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]
module.gha.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]
module.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]
module.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]
module.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]
module.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]
module.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]
module.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]
module.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]
module.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]
module.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]
module.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]
module.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]
module.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]
module.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]
module.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]
module.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]
module.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]
module.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]
module.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]
module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]
module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]
module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]
module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]
module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]
module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]
module.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]
module.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]
module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]
module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]
module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]
module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]
module.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]
module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]
module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]
module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]
module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.gha.module.gha-admin.data.aws_iam_policy_document.admin-trust will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-trust" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.gha.module.gha-admin.data.aws_iam_policy_document.github-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github-permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.gha.module.gha-admin.aws_iam_policy.github will be created
  + resource "aws_iam_policy" "github" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-foo-github"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.gha.module.gha-admin.aws_iam_role.admin will be created
  + resource "aws_iam_role" "admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Role to manage AWS account"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-foo-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.gha.module.gha-admin.aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/foo:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo foo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-foo-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.gha.module.gha-admin.aws_iam_role_policy_attachment.admin will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "ih-tf-foo-admin"
    }

  # module.gha.module.gha-admin.aws_iam_role_policy_attachment.github will be created
  + resource "aws_iam_role_policy_attachment" "github" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-foo-github"
    }

  # module.gha.module.state-bucket.aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "state_bucket" = "infrahouse-foo"
        }
      + tags_all         = {
          + "state_bucket" = "infrahouse-foo"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }
    }

  # module.gha.module.state-bucket.aws_s3_bucket.state-bucket will be created
  + resource "aws_s3_bucket" "state-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-foo"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.gha.module.state-bucket.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.gha.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.gha.module.state-bucket.aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.gha.module.state-bucket.random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-foo"
      + separator = "-"
    }

  # module.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "000"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions_rw" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-foo/*.zip",
              + "arn:aws:s3:::infrahouse-foo/plans/*",
              + "arn:aws:s3:::infrahouse-foo/terraform.tfstate",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.gha.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-foo-state-manager-ro"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-foo"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-foo/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-foo/plans/*",
                          + "arn:aws:s3:::infrahouse-foo/*.zip",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.gha.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-foo-state-manager-rw"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.gha.module.gha-admin.module.state-manager.aws_iam_role.state-manager will be created
  + resource "aws_iam_role" "state-manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Role to manage a terraform state of a repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-foo-state-manager"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.gha.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-foo-state-manager"
    }

  # module.gha.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-foo-state-manager"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=4085685291]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Amodule.gha.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Amodule.gha.module.gha-admin.data.aws_iam_policy.admin: Reading...%0Amodule.gha.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.gha.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.gha.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=4074999951]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]%0Amodule.gha.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]%0Amodule.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]%0Amodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.gha.module.gha-admin.data.aws_iam_policy_document.admin-trust will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "admin-trust" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A%0A          + principals {%0A              + identifiers = [%0A                  + (known after apply),%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A    }%0A%0A  # module.gha.module.gha-admin.data.aws_iam_policy_document.github-permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "github-permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "sts:AssumeRole",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # module.gha.module.gha-admin.aws_iam_policy.github will be created%0A  + resource "aws_iam_policy" "github" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-foo-github"%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # module.gha.module.gha-admin.aws_iam_role.admin will be created%0A  + resource "aws_iam_role" "admin" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + description           = "Role to manage AWS account"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-foo-admin"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.gha.module.gha-admin.aws_iam_role.github will be created%0A  + resource "aws_iam_role" "github" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/foo:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role for a GitHub Actions runner in repo foo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-foo-github"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.gha.module.gha-admin.aws_iam_role_policy_attachment.admin will be created%0A  + resource "aws_iam_role_policy_attachment" "admin" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "ih-tf-foo-admin"%0A    }%0A%0A  # module.gha.module.gha-admin.aws_iam_role_policy_attachment.github will be created%0A  + resource "aws_iam_role_policy_attachment" "github" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-foo-github"%0A    }%0A%0A  # module.gha.module.state-bucket.aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "state_bucket" = "infrahouse-foo"%0A        }%0A      + tags_all         = {%0A          + "state_bucket" = "infrahouse-foo"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A    }%0A%0A  # module.gha.module.state-bucket.aws_s3_bucket.state-bucket will be created%0A  + resource "aws_s3_bucket" "state-bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "infrahouse-foo"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.gha.module.state-bucket.aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.gha.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.gha.module.state-bucket.aws_s3_bucket_versioning.enabled will be created%0A  + resource "aws_s3_bucket_versioning" "enabled" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.gha.module.state-bucket.random_pet.suffix will be created%0A  + resource "random_pet" "suffix" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "infrahouse-foo"%0A      + separator = "-"%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "assume" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A          + sid     = "000"%0A%0A          + principals {%0A              + identifiers = [%0A                  + (known after apply),%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "permissions_rw" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:DeleteObject",%0A              + "s3:PutObject",%0A            ]%0A          + resources = [%0A              + "arn:aws:s3:::infrahouse-foo/*.zip",%0A              + "arn:aws:s3:::infrahouse-foo/plans/*",%0A              + "arn:aws:s3:::infrahouse-foo/terraform.tfstate",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "dynamodb:DeleteItem",%0A              + "dynamodb:DescribeTable",%0A              + "dynamodb:GetItem",%0A              + "dynamodb:PutItem",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro will be created%0A  + resource "aws_iam_policy" "permissions_ro" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-foo-state-manager-ro"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-foo"%0A                    },%0A                  + {%0A                      + Action   = "s3:GetObject"%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-foo/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-foo/plans/*",%0A                          + "arn:aws:s3:::infrahouse-foo/*.zip",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw will be created%0A  + resource "aws_iam_policy" "permissions_rw" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-foo-state-manager-rw"%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.aws_iam_role.state-manager will be created%0A  + resource "aws_iam_role" "state-manager" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + description           = "Role to manage a terraform state of a repo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-foo-state-manager"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-foo-state-manager"%0A    }%0A%0A  # module.gha.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-foo-state-manager"%0A    }%0A%0APlan: 16 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvZDI2OTM3MTYtOTFiOS00OTkzLThjOGQtYTk4YjY5NWFjYTM3L3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLW5vLWNvbG9yIC0tb3V0PXRmLnBsYW5cbmRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkaW5nLi4uXG5kYXRhLmV4dGVybmFsLmVudjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9LV1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXG5tb2R1bGUuaWg4X3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV1cbm1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXG5naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVxuZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVxuZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXG5naXRodWJfdGVhbV9tZW1iZXJzLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cbm1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tdGVtcGxhdGVdXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpHSF9UT0tFTl1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXG5tb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLlxubW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwODU2ODUyOTFdXG5kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLlxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLlxubW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbm1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLlxubW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MDc0OTk5OTUxXVxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cbmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEddXG5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmNvZGFjeV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX0NPREFDWV9QUk9KRUNUX1RPS0VOLWZobE9TMnxBV1NDVVJSRU5UXVxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEd8QVdTQ1VSUkVOVF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb11cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZV1cbm1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya11cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb21dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXVxubW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldF1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtY29tXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnByb3h5c3FsLXNhbmRib3hdXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwdXBwZXQtY29kZV1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZV1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJDT0RBQ1lfUFJPSkVDVF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkNPREFDWV9QUk9KRUNUX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb206QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJQWVBJX0FQSV9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcms6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXQ6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3g6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcjpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcjpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX0RFRkFVTFRfUkVHSU9OXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tdHJ1c3Qgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwiYWRtaW4tdHJ1c3RcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLFxuICAgICAgICAgICAgXVxuXG4gICAgICAgICAgKyBwcmluY2lwYWxzIHtcbiAgICAgICAgICAgICAgKyBpZGVudGlmaWVycyA9IFtcbiAgICAgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkFXU1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwiZ2l0aHViLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBqc29uID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIHN0YXRlbWVudCB7XG4gICAgICAgICAgKyBhY3Rpb25zICAgPSBbXG4gICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSxcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiZ2l0aHViXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtZm9vLWdpdGh1YlwiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJhZG1pblwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIG1hbmFnZSBBV1MgYWNjb3VudFwiXG4gICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtZm9vLWFkbWluXCJcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwiZ2l0aHViXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvZm9vOipcIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSBmb3IgYSBHaXRIdWIgQWN0aW9ucyBydW5uZXIgaW4gcmVwbyBmb29cIlxuICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMFxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWZvby1naXRodWJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW4gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImFkbWluXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXCJcbiAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtZm9vLWFkbWluXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZ2l0aHViXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1mb28tZ2l0aHViXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrcyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19keW5hbW9kYl90YWJsZVwiIFwidGVycmFmb3JtX2xvY2tzXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBiaWxsaW5nX21vZGUgICAgID0gXCJQQVlfUEVSX1JFUVVFU1RcIlxuICAgICAgKyBoYXNoX2tleSAgICAgICAgID0gXCJMb2NrSURcIlxuICAgICAgKyBpZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWFkX2NhcGFjaXR5ICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdHJlYW1fYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdHJlYW1fbGFiZWwgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdHJlYW1fdmlld190eXBlID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiA9IFwiaW5mcmFob3VzZS1mb29cIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiID0gXCJpbmZyYWhvdXNlLWZvb1wiXG4gICAgICAgIH1cbiAgICAgICsgd3JpdGVfY2FwYWNpdHkgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBhdHRyaWJ1dGUge1xuICAgICAgICAgICsgbmFtZSA9IFwiTG9ja0lEXCJcbiAgICAgICAgICArIHR5cGUgPSBcIlNcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmdoYS5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtZm9vXCJcbiAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5naGEubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzcyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHtcbiAgICAgICsgYmxvY2tfcHVibGljX2FjbHMgICAgICAgPSB0cnVlXG4gICAgICArIGJsb2NrX3B1YmxpY19wb2xpY3kgICAgID0gdHJ1ZVxuICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlnbm9yZV9wdWJsaWNfYWNscyAgICAgID0gdHJ1ZVxuICAgICAgKyByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWVcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uXCIgXCJkZWZhdWx0XCIge1xuICAgICAgKyBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBydWxlIHtcbiAgICAgICAgICArIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCB7XG4gICAgICAgICAgICAgICsgc3NlX2FsZ29yaXRobSA9IFwiQUVTMjU2XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5naGEubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfdmVyc2lvbmluZ1wiIFwiZW5hYmxlZFwiIHtcbiAgICAgICsgYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgdmVyc2lvbmluZ19jb25maWd1cmF0aW9uIHtcbiAgICAgICAgICArIG1mYV9kZWxldGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgKyBzdGF0dXMgICAgID0gXCJFbmFibGVkXCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5naGEubW9kdWxlLnN0YXRlLWJ1Y2tldC5yYW5kb21fcGV0LnN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcInJhbmRvbV9wZXRcIiBcInN1ZmZpeFwiIHtcbiAgICAgICsgaWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBsZW5ndGggICAgPSAyXG4gICAgICArIHByZWZpeCAgICA9IFwiaW5mcmFob3VzZS1mb29cIlxuICAgICAgKyBzZXBhcmF0b3IgPSBcIi1cIlxuICAgIH1cblxuICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pXG4gPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJhc3N1bWVcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgc2lkICAgICA9IFwiMDAwXCJcblxuICAgICAgICAgICsgcHJpbmNpcGFscyB7XG4gICAgICAgICAgICAgICsgaWRlbnRpZmllcnMgPSBbXG4gICAgICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIHR5cGUgICAgICAgID0gXCJBV1NcIlxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcncgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicGVybWlzc2lvbnNfcndcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgICA9IFtcbiAgICAgICAgICAgICAgKyBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICBdXG4gICAgICAgICAgKyByZXNvdXJjZXMgPSBbXG4gICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1mb28vKi56aXBcIixcbiAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWZvby9wbGFucy8qXCIsXG4gICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1mb28vdGVycmFmb3JtLnRmc3RhdGVcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICArIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICBdXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcm9cIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlci1yb1wiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1mb29cIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6R2V0T2JqZWN0XCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWZvby90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZm9vL3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWZvby8qLnppcFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcncgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNfcndcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlci1yd1wiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInN0YXRlLW1hbmFnZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byBtYW5hZ2UgYSB0ZXJyYWZvcm0gc3RhdGUgb2YgYSByZXBvXCJcbiAgICAgICsgZm9yY2VfZGV0YWNoX3BvbGljaWVzID0gZmFsc2VcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDBcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlclwiXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCJcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJvXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJ3XCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG5QbGFuOiAxNiB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkaW5nLi4uJTBBZGF0YS5leHRlcm5hbC5lbnY6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPS1dJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF0lMEFtb2R1bGUuaWg4X3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFtb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXSUwQWdpdGh1Yl9tZW1iZXJzaGlwLmluZnJhaG91c2VbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlOmFrdXptaW5za3ldJTBBZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XSUwQWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXSUwQWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XSUwQW1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tdGVtcGxhdGVdJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOmFrdXptaW5za3ldJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSTJ2dTdNNENBaWNpXSUwQW1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwODU2ODUyOTFdJTBBZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZGluZy4uLiUwQW1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDA3NDk5OTk1MV0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFkYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV0lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuY29kYWN5X2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX0NPREFDWV9QUk9KRUNUX1RPS0VOLWZobE9TMl0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyfEFXU0NVUlJFTlRdJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEd8QVdTQ1VSUkVOVF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZV0lMEFtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3hdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya10lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb21dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtY29tXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb10lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6cHJveHlzcWwtc2FuZGJveF0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwdXBwZXQtY29kZV0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQ09EQUNZX1BST0pFQ1RfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpDT0RBQ1lfUFJPSkVDVF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIlBZUElfQVBJX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb206R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbjpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3g6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXI6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcjpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZTpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfREVGQVVMVF9SRUdJT05dJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi10cnVzdCB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImFkbWluLXRydXN0XCIgeyUwQSAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgPSBbJTBBICAgICAgICAgICAgICArIFwic3RzOkFzc3VtZVJvbGVcIiwlMEEgICAgICAgICAgICBdJTBBJTBBICAgICAgICAgICsgcHJpbmNpcGFscyB7JTBBICAgICAgICAgICAgICArIGlkZW50aWZpZXJzID0gWyUwQSAgICAgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQVdTXCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwiZ2l0aHViLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyByZXNvdXJjZXMgPSBbJTBBICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksJTBBICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImdpdGh1YlwiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1mb28tZ2l0aHViXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwiYWRtaW5cIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gbWFuYWdlIEFXUyBhY2NvdW50XCIlMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWZvby1hZG1pblwiJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwiZ2l0aHViXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBDb25kaXRpb24gPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0VxdWFscyA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdMaWtlICAgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvZm9vOipcIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgRmVkZXJhdGVkID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgZm9yIGEgR2l0SHViIEFjdGlvbnMgcnVubmVyIGluIHJlcG8gZm9vXCIlMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWZvby1naXRodWJcIiUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiYWRtaW5cIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc1wiJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1mb28tYWRtaW5cIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZ2l0aHViXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1mb28tZ2l0aHViXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZHluYW1vZGJfdGFibGVcIiBcInRlcnJhZm9ybV9sb2Nrc1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBiaWxsaW5nX21vZGUgICAgID0gXCJQQVlfUEVSX1JFUVVFU1RcIiUwQSAgICAgICsgaGFzaF9rZXkgICAgICAgICA9IFwiTG9ja0lEXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVhZF9jYXBhY2l0eSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdHJlYW1fbGFiZWwgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RyZWFtX3ZpZXdfdHlwZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiA9IFwiaW5mcmFob3VzZS1mb29cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiID0gXCJpbmZyYWhvdXNlLWZvb1wiJTBBICAgICAgICB9JTBBICAgICAgKyB3cml0ZV9jYXBhY2l0eSAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgYXR0cmlidXRlIHslMEEgICAgICAgICAgKyBuYW1lID0gXCJMb2NrSURcIiUwQSAgICAgICAgICArIHR5cGUgPSBcIlNcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5naGEubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7JTBBICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtZm9vXCIlMEEgICAgICArIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmdoYS5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHslMEEgICAgICArIGJsb2NrX3B1YmxpY19hY2xzICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYmxvY2tfcHVibGljX3BvbGljeSAgICAgPSB0cnVlJTBBICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWdub3JlX3B1YmxpY19hY2xzICAgICAgPSB0cnVlJTBBICAgICAgKyByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWUlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvblwiIFwiZGVmYXVsdFwiIHslMEEgICAgICArIGJ1Y2tldCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHJ1bGUgeyUwQSAgICAgICAgICArIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCB7JTBBICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gPSBcIkFFUzI1NlwiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5naGEubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3ZlcnNpb25pbmdcIiBcImVuYWJsZWRcIiB7JTBBICAgICAgKyBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyB2ZXJzaW9uaW5nX2NvbmZpZ3VyYXRpb24geyUwQSAgICAgICAgICArIG1mYV9kZWxldGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICsgc3RhdHVzICAgICA9IFwiRW5hYmxlZFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmdoYS5tb2R1bGUuc3RhdGUtYnVja2V0LnJhbmRvbV9wZXQuc3VmZml4IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcInJhbmRvbV9wZXRcIiBcInN1ZmZpeFwiIHslMEEgICAgICArIGlkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGxlbmd0aCAgICA9IDIlMEEgICAgICArIHByZWZpeCAgICA9IFwiaW5mcmFob3VzZS1mb29cIiUwQSAgICAgICsgc2VwYXJhdG9yID0gXCItXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWUgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93biklMEEgPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJhc3N1bWVcIiB7JTBBICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyA9IFslMEEgICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyBzaWQgICAgID0gXCIwMDBcIiUwQSUwQSAgICAgICAgICArIHByaW5jaXBhbHMgeyUwQSAgICAgICAgICAgICAgKyBpZGVudGlmaWVycyA9IFslMEEgICAgICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkFXU1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5naGEubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3IHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicGVybWlzc2lvbnNfcndcIiB7JTBBICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcInMzOkRlbGV0ZU9iamVjdFwiLCUwQSAgICAgICAgICAgICAgKyBcInMzOlB1dE9iamVjdFwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyByZXNvdXJjZXMgPSBbJTBBICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZm9vLyouemlwXCIsJTBBICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZm9vL3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1mb28vdGVycmFmb3JtLnRmc3RhdGVcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZWxldGVJdGVtXCIsJTBBICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLCUwQSAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpQdXRJdGVtXCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yb1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlci1yb1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWZvb1wiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpHZXRPYmplY3RcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZm9vL3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZm9vL3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1mb28vKi56aXBcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcncgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3J3XCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWZvby1zdGF0ZS1tYW5hZ2VyLXJ3XCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJzdGF0ZS1tYW5hZ2VyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIG1hbmFnZSBhIHRlcnJhZm9ybSBzdGF0ZSBvZiBhIHJlcG9cIiUwQSAgICAgICsgZm9yY2VfZGV0YWNoX3BvbGljaWVzID0gZmFsc2UlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDAlMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtZm9vLXN0YXRlLW1hbmFnZXJcIiUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZ2hhLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm8gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJvXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1mb28tc3RhdGUtbWFuYWdlclwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmdoYS5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlci1yd1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtZm9vLXN0YXRlLW1hbmFnZXJcIiUwQSAgICB9JTBBJTBBUGxhbjogMTYgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAxNiwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```
</p></details>